Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/adc.h
/* -------- ADC_INTENSET : (ADC Offset: 0x04) (R/W 32) Interrupt Enable Set -------- */
#define ADC_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (ADC_INTENSET) Interrupt Enable Set  Reset Value */

#define ADC_INTENSET_CMPHIT_Pos               _UINT32_(4)                                          /* (ADC_INTENSET) Compare Hit Enable Position */
#define ADC_INTENSET_CMPHIT_Msk               (_UINT32_(0x1) << ADC_INTENSET_CMPHIT_Pos)           /* (ADC_INTENSET) Compare Hit Enable Mask */
#define ADC_INTENSET_CMPHIT(value)            (ADC_INTENSET_CMPHIT_Msk & (_UINT32_(value) << ADC_INTENSET_CMPHIT_Pos)) /* Assigment of value for CMPHIT in the ADC_INTENSET register */
#define ADC_INTENSET_SOVFL_Pos                _UINT32_(7)                                          /* (ADC_INTENSET) Synchronizer Overflow Enable Position */
#define ADC_INTENSET_SOVFL_Msk                (_UINT32_(0x1) << ADC_INTENSET_SOVFL_Pos)            /* (ADC_INTENSET) Synchronizer Overflow Enable Mask */
#define ADC_INTENSET_SOVFL(value)             (ADC_INTENSET_SOVFL_Msk & (_UINT32_(value) << ADC_INTENSET_SOVFL_Pos)) /* Assigment of value for SOVFL in the ADC_INTENSET register */
#define ADC_INTENSET_CHRDYC_Pos               _UINT32_(8)                                          /* (ADC_INTENSET) Current Channel Ready Enable Position */
#define ADC_INTENSET_CHRDYC_Msk               (_UINT32_(0x1) << ADC_INTENSET_CHRDYC_Pos)           /* (ADC_INTENSET) Current Channel Ready Enable Mask */
#define ADC_INTENSET_CHRDYC(value)            (ADC_INTENSET_CHRDYC_Msk & (_UINT32_(value) << ADC_INTENSET_CHRDYC_Pos)) /* Assigment of value for CHRDYC in the ADC_INTENSET register */
#define ADC_INTENSET_FLTRDY_Pos               _UINT32_(9)                                          /* (ADC_INTENSET) Filter Ready Enable Position */
#define ADC_INTENSET_FLTRDY_Msk               (_UINT32_(0x1) << ADC_INTENSET_FLTRDY_Pos)           /* (ADC_INTENSET) Filter Ready Enable Mask */
#define ADC_INTENSET_FLTRDY(value)            (ADC_INTENSET_FLTRDY_Msk & (_UINT32_(value) << ADC_INTENSET_FLTRDY_Pos)) /* Assigment of value for FLTRDY in the ADC_INTENSET register */
#define ADC_INTENSET_CHNERRC_Pos              _UINT32_(10)                                         /* (ADC_INTENSET) Channel Overwrite Enable Position */
#define ADC_INTENSET_CHNERRC_Msk              (_UINT32_(0x1) << ADC_INTENSET_CHNERRC_Pos)          /* (ADC_INTENSET) Channel Overwrite Enable Mask */
#define ADC_INTENSET_CHNERRC(value)           (ADC_INTENSET_CHNERRC_Msk & (_UINT32_(value) << ADC_INTENSET_CHNERRC_Pos)) /* Assigment of value for CHNERRC in the ADC_INTENSET register */
#define ADC_INTENSET_EOSRDY_Pos               _UINT32_(11)                                         /* (ADC_INTENSET) End of Scan Enable Position */
#define ADC_INTENSET_EOSRDY_Msk               (_UINT32_(0x1) << ADC_INTENSET_EOSRDY_Pos)           /* (ADC_INTENSET) End of Scan Enable Mask */
#define ADC_INTENSET_EOSRDY(value)            (ADC_INTENSET_EOSRDY_Msk & (_UINT32_(value) << ADC_INTENSET_EOSRDY_Pos)) /* Assigment of value for EOSRDY in the ADC_INTENSET register */
#define ADC_INTENSET_CHRDY_Pos                _UINT32_(16)                                         /* (ADC_INTENSET) Channel Ready Enable Position */
#define ADC_INTENSET_CHRDY_Msk                (_UINT32_(0xFFFF) << ADC_INTENSET_CHRDY_Pos)         /* (ADC_INTENSET) Channel Ready Enable Mask */
#define ADC_INTENSET_CHRDY(value)             (ADC_INTENSET_CHRDY_Msk & (_UINT32_(value) << ADC_INTENSET_CHRDY_Pos)) /* Assigment of value for CHRDY in the ADC_INTENSET register */
#define ADC_INTENSET_Msk                      _UINT32_(0xFFFF0F90)                                 /* (ADC_INTENSET) Register Mask  */


/* -------- ADC_INTFLAG : (ADC Offset: 0x08) (R/W 32) Interrupt Flags -------- */
#define ADC_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_INTFLAG) Interrupt Flags  Reset Value */

#define ADC_INTFLAG_CMPINTID_Pos              _UINT32_(0)                                          /* (ADC_INTFLAG) Compare Channel ID Position */
#define ADC_INTFLAG_CMPINTID_Msk              (_UINT32_(0xF) << ADC_INTFLAG_CMPINTID_Pos)          /* (ADC_INTFLAG) Compare Channel ID Mask */
#define ADC_INTFLAG_CMPINTID(value)           (ADC_INTFLAG_CMPINTID_Msk & (_UINT32_(value) << ADC_INTFLAG_CMPINTID_Pos)) /* Assigment of value for CMPINTID in the ADC_INTFLAG register */
#define ADC_INTFLAG_CMPHIT_Pos                _UINT32_(4)                                          /* (ADC_INTFLAG) Compare Hit Position */
#define ADC_INTFLAG_CMPHIT_Msk                (_UINT32_(0x1) << ADC_INTFLAG_CMPHIT_Pos)            /* (ADC_INTFLAG) Compare Hit Mask */
#define ADC_INTFLAG_CMPHIT(value)             (ADC_INTFLAG_CMPHIT_Msk & (_UINT32_(value) << ADC_INTFLAG_CMPHIT_Pos)) /* Assigment of value for CMPHIT in the ADC_INTFLAG register */
#define ADC_INTFLAG_SOVFL_Pos                 _UINT32_(7)                                          /* (ADC_INTFLAG) Synchronizer Overflow Position */
#define ADC_INTFLAG_SOVFL_Msk                 (_UINT32_(0x1) << ADC_INTFLAG_SOVFL_Pos)             /* (ADC_INTFLAG) Synchronizer Overflow Mask */
#define ADC_INTFLAG_SOVFL(value)              (ADC_INTFLAG_SOVFL_Msk & (_UINT32_(value) << ADC_INTFLAG_SOVFL_Pos)) /* Assigment of value for SOVFL in the ADC_INTFLAG register */
#define ADC_INTFLAG_CHRDYC_Pos                _UINT32_(8)                                          /* (ADC_INTFLAG) Current Channel Ready Position */
#define ADC_INTFLAG_CHRDYC_Msk                (_UINT32_(0x1) << ADC_INTFLAG_CHRDYC_Pos)            /* (ADC_INTFLAG) Current Channel Ready Mask */
#define ADC_INTFLAG_CHRDYC(value)             (ADC_INTFLAG_CHRDYC_Msk & (_UINT32_(value) << ADC_INTFLAG_CHRDYC_Pos)) /* Assigment of value for CHRDYC in the ADC_INTFLAG register */
#define ADC_INTFLAG_FLTRDY_Pos                _UINT32_(9)                                          /* (ADC_INTFLAG) Filter Ready Position */
#define ADC_INTFLAG_FLTRDY_Msk                (_UINT32_(0x1) << ADC_INTFLAG_FLTRDY_Pos)            /* (ADC_INTFLAG) Filter Ready Mask */
#define ADC_INTFLAG_FLTRDY(value)             (ADC_INTFLAG_FLTRDY_Msk & (_UINT32_(value) << ADC_INTFLAG_FLTRDY_Pos)) /* Assigment of value for FLTRDY in the ADC_INTFLAG register */
#define ADC_INTFLAG_CHNERRC_Pos               _UINT32_(10)                                         /* (ADC_INTFLAG) Channel Overwrite Error Position */
#define ADC_INTFLAG_CHNERRC_Msk               (_UINT32_(0x1) << ADC_INTFLAG_CHNERRC_Pos)           /* (ADC_INTFLAG) Channel Overwrite Error Mask */
#define ADC_INTFLAG_CHNERRC(value)            (ADC_INTFLAG_CHNERRC_Msk & (_UINT32_(value) << ADC_INTFLAG_CHNERRC_Pos)) /* Assigment of value for CHNERRC in the ADC_INTFLAG register */
#define ADC_INTFLAG_EOSRDY_Pos                _UINT32_(11)                                         /* (ADC_INTFLAG) End of Scan Ready Position */
#define ADC_INTFLAG_EOSRDY_Msk                (_UINT32_(0x1) << ADC_INTFLAG_EOSRDY_Pos)            /* (ADC_INTFLAG) End of Scan Ready Mask */
#define ADC_INTFLAG_EOSRDY(value)             (ADC_INTFLAG_EOSRDY_Msk & (_UINT32_(value) << ADC_INTFLAG_EOSRDY_Pos)) /* Assigment of value for EOSRDY in the ADC_INTFLAG register */
#define ADC_INTFLAG_CRDYID_Pos                _UINT32_(12)                                         /* (ADC_INTFLAG) Channel Ready ID Position */
#define ADC_INTFLAG_CRDYID_Msk                (_UINT32_(0xF) << ADC_INTFLAG_CRDYID_Pos)            /* (ADC_INTFLAG) Channel Ready ID Mask */
#define ADC_INTFLAG_CRDYID(value)             (ADC_INTFLAG_CRDYID_Msk & (_UINT32_(value) << ADC_INTFLAG_CRDYID_Pos)) /* Assigment of value for CRDYID in the ADC_INTFLAG register */
#define ADC_INTFLAG_CHRDY_Pos                 _UINT32_(16)                                         /* (ADC_INTFLAG) Channel Ready Position */
#define ADC_INTFLAG_CHRDY_Msk                 (_UINT32_(0xFFFF) << ADC_INTFLAG_CHRDY_Pos)          /* (ADC_INTFLAG) Channel Ready Mask */
#define ADC_INTFLAG_CHRDY(value)              (ADC_INTFLAG_CHRDY_Msk & (_UINT32_(value) << ADC_INTFLAG_CHRDY_Pos)) /* Assigment of value for CHRDY in the ADC_INTFLAG register */
#define ADC_INTFLAG_Msk                       _UINT32_(0xFFFFFF9F)                                 /* (ADC_INTFLAG) Register Mask  */


/* -------- ADC_CTRLA : (ADC Offset: 0x00) (R/W 32) CONTROL A REGISTER -------- */
#define ADC_CTRLA_RESETVALUE                  _UINT32_(0x80)                                       /*  (ADC_CTRLA) CONTROL A REGISTER  Reset Value */

#define ADC_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (ADC_CTRLA) SOFTWARE RESET BIT Position */
#define ADC_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << ADC_CTRLA_SWRST_Pos)               /* (ADC_CTRLA) SOFTWARE RESET BIT Mask */
#define ADC_CTRLA_SWRST(value)                (ADC_CTRLA_SWRST_Msk & (_UINT32_(value) << ADC_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the ADC_CTRLA register */
#define ADC_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (ADC_CTRLA) ENABLE BIT Position */
#define ADC_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << ADC_CTRLA_ENABLE_Pos)              /* (ADC_CTRLA) ENABLE BIT Mask */
#define ADC_CTRLA_ENABLE(value)               (ADC_CTRLA_ENABLE_Msk & (_UINT32_(value) << ADC_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the ADC_CTRLA register */
#define ADC_CTRLA_ANAEN_Pos                   _UINT32_(2)                                          /* (ADC_CTRLA) Analog Enable Position */
#define ADC_CTRLA_ANAEN_Msk                   (_UINT32_(0x1) << ADC_CTRLA_ANAEN_Pos)               /* (ADC_CTRLA) Analog Enable Mask */
#define ADC_CTRLA_ANAEN(value)                (ADC_CTRLA_ANAEN_Msk & (_UINT32_(value) << ADC_CTRLA_ANAEN_Pos)) /* Assigment of value for ANAEN in the ADC_CTRLA register */
#define ADC_CTRLA_AIPMPEN_Pos                 _UINT32_(4)                                          /* (ADC_CTRLA) Charge Pump Enable Position */
#define ADC_CTRLA_AIPMPEN_Msk                 (_UINT32_(0x1) << ADC_CTRLA_AIPMPEN_Pos)             /* (ADC_CTRLA) Charge Pump Enable Mask */
#define ADC_CTRLA_AIPMPEN(value)              (ADC_CTRLA_AIPMPEN_Msk & (_UINT32_(value) << ADC_CTRLA_AIPMPEN_Pos)) /* Assigment of value for AIPMPEN in the ADC_CTRLA register */
#define ADC_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (ADC_CTRLA) Run in Standby Position */
#define ADC_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << ADC_CTRLA_RUNSTDBY_Pos)            /* (ADC_CTRLA) Run in Standby Mask */
#define ADC_CTRLA_RUNSTDBY(value)             (ADC_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << ADC_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the ADC_CTRLA register */
#define ADC_CTRLA_ONDEMAND_Pos                _UINT32_(7)                                          /* (ADC_CTRLA) On Demand Control Position */
#define ADC_CTRLA_ONDEMAND_Msk                (_UINT32_(0x1) << ADC_CTRLA_ONDEMAND_Pos)            /* (ADC_CTRLA) On Demand Control Mask */
#define ADC_CTRLA_ONDEMAND(value)             (ADC_CTRLA_ONDEMAND_Msk & (_UINT32_(value) << ADC_CTRLA_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the ADC_CTRLA register */
#define ADC_CTRLA_Msk                         _UINT32_(0x000000D7)                                 /* (ADC_CTRLA) Register Mask  */


